trade_exp/src/Documents/СчетФактураПолученный/СчетФактураПолученный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураПолученный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИсправления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОтнестиКПредыдущемуОтчетномуКварталу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерИсправления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СоставленКомиссионеромОтИмениПродавца</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСоставления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученВЭлектронномВиде</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодВидаОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодВидаОперацииНаУменьшение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd713d3d-c98e-4a8f-8fc2-b1329037384c">
    <name>ИННКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0e0ef7e6-411c-40a2-86d2-e56ca7b4d156">
    <name>ДатаЗаписиКнигиПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cbabc52-e05c-4cd3-8a42-8fe436c507ab">
    <name>КППКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bf4dba77-3672-46ad-bedf-f8cd6afdd276">
    <name>Исправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea94de1e-2936-403e-9af0-91b7c8b55cd6">
    <name>Корректировочный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f21439d2-630c-4aa6-8315-b82887e6b36b">
    <name>ДатаЗаписиКнигиПокупок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="168d9b98-287a-4133-8c5b-69a0e3e88dcd">
    <name>ДатаСозданияДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e437a15a-4b1e-4319-853c-c6c06186ba9f">
      <name>СуммаУменьшениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="def81422-4b76-4f7e-9f90-35dd25d84733">
      <name>СуммаНДСКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dba954d2-ebe7-426b-9ef7-8cb412ca2ddd">
      <name>СуммаНДСУвеличениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0a25e3d2-8a1d-492a-9b20-42b5435226bf">
      <name>СуммаНДСУвеличение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f3378054-cd6e-48bc-844e-28d8529b3388">
      <name>ИсходныйДокумент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b114798-fc5d-4d59-8476-11e0bb19352f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b4d55bcb-508e-42ef-9074-65364bac4176">
      <name>СуммаУменьшение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ac88564b-289e-47ac-ae09-88366f9e6b74">
      <name>СуммаУвеличение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e40f2fdc-51ba-4290-a6d3-e44549a904af">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12592a23-09f7-4fd2-8764-7b4f2950fdf0">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c04c4cfa-f7e9-4385-b3c3-3d10aeb2eac3">
      <name>СуммаНДСУменьшение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8842f868-82c5-4c50-b80c-adf5a575ffce">
      <name>СуммаКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="50686e73-d853-41f1-8bd5-d9461bcef0bf">
      <name>СуммаУвеличениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="adb14093-3806-459a-849d-5f1fa3d34976">
      <name>СуммаНДСУменьшениеКомиссия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04176231-3718-4701-b1b2-11cef873d0dc">
      <name>ПринятоКВычетуНДСДоВводаОстатков</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3f913d02-0952-4656-a9c0-8b1c395bd8d5">
      <name>СтавкаНДСДоВводаОстатков</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="90f1c654-c4fb-454e-812e-65be36b93757">
      <name>ВидЦенности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c0d716d1-8496-4587-b452-04e67634da9e">
    <name>Продавцы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/СчетФактураПолученный/Forms/ФормаДокумента/Module.bsl
//nzk Задача № 156477
&НаСервере
&После("ОбновитьИнформацию")
Процедура Док_ОбновитьИнформацию()
	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
    ОбъектДокумента.УстановкаПравильнойДаты();
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ЗаполнитьДатуПолучения")
Процедура Док_ЗаполнитьДатуПолучения()
    #Удаление
	Если Объект.Исправление И ЗначениеЗаполнено(Объект.ДатаИсправления) Тогда
		Объект.Дата = Объект.ДатаИсправления;
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаСоставления) Тогда
		Объект.Дата = Объект.ДатаСоставления;
	КонецЕсли;
    
	ДатаПолученияПриИзмененииКлиент();
    #КонецУдаления
	
	#Вставка
	УстановкаПравильнойДаты();
	
	ДатаПолученияПриИзмененииКлиент();
	#КонецВставки
	
КонецПроцедуры

&НаСервере
Процедура УстановкаПравильнойДаты()
	Если ЗначениеЗаполнено(ДокументыОснованияПредставление) Тогда
		ОбъектДокумента = РеквизитФормыВЗначение("Объект");
    	ОбъектДокумента.УстановкаПравильнойДаты();
	КонецЕсли;	
КонецПроцедуры
